# GetReferenceType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..GetReferenceType Method
FamilyInstance Class See Also
---
Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public FamilyInstanceReferenceType GetReferenceType(
	Reference reference
)
```

Visual Basic
---
```text
Public Function GetReferenceType ( _
	reference As Reference _
) As FamilyInstanceReferenceType
```

Visual C++
---
```text
public:
FamilyInstanceReferenceType GetReferenceType(
	Reference^ reference
)
```

# ### Parameters
reference
    Type: Autodesk.Revit.DB..::..Reference The family instance reference.
# ### Return Value
Returns the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference. Returns FamilyInstanceReferenceType.NotAReference if the instance reference doesn't correspond to a reference plane or line in the family.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace